In [46]:
def get_list_of_university_towns():
    import pandas as pd
    '''Returns a DataFrame of towns and the states they are in from the 
    university_towns.txt list. The format of the DataFrame should be:
    DataFrame( [ ["Michigan", "Ann Arbor"], ["Michigan", "Yipsilanti"] ], 
    columns=["State", "RegionName"]  )'''
    with open('university_towns.txt') as file:
        data = []
        for line in file:
            data.append(line[:-1])
    state_town = []
    for line in data:
        if line[-6:] == '[edit]':
            state = line[:-6]
        elif '(' in line:
            town = line.split('(')[0]
            state_town.append([state,town])
        else:
            town = line
            state_town.append([state,town])
    state_college_df = pd.DataFrame(state_town,columns = ['State','RegionName'])
    return state_college_df

get_list_of_university_towns()

             State                     RegionName
0          Alabama                        Auburn
1          Alabama                      Florence
2          Alabama                  Jacksonville
3          Alabama                    Livingston
4          Alabama                    Montevallo
5          Alabama                          Troy
6          Alabama                    Tuscaloosa
7          Alabama                      Tuskegee
8           Alaska                     Fairbanks
9          Arizona                     Flagstaff
10         Arizona                         Tempe
11         Arizona                        Tucson
12        Arkansas                   Arkadelphia
13        Arkansas                        Conway
14        Arkansas                  Fayetteville
15        Arkansas                     Jonesboro
16        Arkansas                      Magnolia
17        Arkansas                    Monticello
18        Arkansas                  Russellville
19        Arkansas                        Searcy
20      California                        Angwin
21      California                        Arcata
22      California                      Berkeley
23      California                         Chico
24      California                     Claremont
25      California                        Cotati
26      California                         Davis
27      California                        Irvine
28      California                    Isla Vista
29      California  University Park, Los Angeles
..             ...                            ...
488       Virginia                    Chesapeake
489     Washington                    Bellingham
490     Washington                        Cheney
491     Washington                    Ellensburg
492     Washington                       Pullman
493     Washington  University District, Seattle
494  West Virginia                        Athens
495  West Virginia                    Buckhannon
496  West Virginia                      Fairmont
497  West Virginia                     Glenville
498  West Virginia                    Huntington
499  West Virginia                    Montgomery
500  West Virginia                    Morgantown
501  West Virginia                 Shepherdstown
502  West Virginia                  West Liberty
503      Wisconsin                      Appleton
504      Wisconsin                    Eau Claire
505      Wisconsin                     Green Bay
506      Wisconsin                     La Crosse
507      Wisconsin                       Madison
508      Wisconsin                     Menomonie
509      Wisconsin                     Milwaukee
510      Wisconsin                       Oshkosh
511      Wisconsin                   Platteville
512      Wisconsin                   River Falls
513      Wisconsin                 Stevens Point
514      Wisconsin                      Waukesha
515      Wisconsin                    Whitewater
516        Wyoming                       Laramie
517        Wyoming

[518 rows x 2 columns]

In [61]:
def get_recession_start():
    '''Returns the year and quarter of the recession start time as a 
    string value in a format such as 2005q3'''
    import pandas as pd
    df = pd.read_excel('~/Downloads/gdplev.xls',skiprows = 7)
    df1 = df[['Unnamed: 4','Unnamed: 6']]
    df1.columns = (['quarter','GDP'])
    df2 = df1.iloc[212:]
    
    
   
    return df2
get_recession_start()

    quarter      GDP
212  2000q1  12359.1
213  2000q2  12592.5
214  2000q3  12607.7
215  2000q4  12679.3
216  2001q1  12643.3
217  2001q2  12710.3
218  2001q3  12670.1
219  2001q4  12705.3
220  2002q1  12822.3
221  2002q2  12893.0
222  2002q3  12955.8
223  2002q4  12964.0
224  2003q1  13031.2
225  2003q2  13152.1
226  2003q3  13372.4
227  2003q4  13528.7
228  2004q1  13606.5
229  2004q2  13706.2
230  2004q3  13830.8
231  2004q4  13950.4
232  2005q1  14099.1
233  2005q2  14172.7
234  2005q3  14291.8
235  2005q4  14373.4
236  2006q1  14546.1
237  2006q2  14589.6
238  2006q3  14602.6
239  2006q4  14716.9
240  2007q1  14726.0
241  2007q2  14838.7
..      ...      ...
248  2009q1  14375.0
249  2009q2  14355.6
250  2009q3  14402.5
251  2009q4  14541.9
252  2010q1  14604.8
253  2010q2  14745.9
254  2010q3  14845.5
255  2010q4  14939.0
256  2011q1  14881.3
257  2011q2  14989.6
258  2011q3  15021.1
259  2011q4  15190.3
260  2012q1  15291.0
261  2012q2  15362.4
262  2012q3  15380.8
263  2012q4  15384.3
264  2013q1  15491.9
265  2013q2  15521.6
266  2013q3  15641.3
267  2013q4  15793.9
268  2014q1  15747.0
269  2014q2  15900.8
270  2014q3  16094.5
271  2014q4  16186.7
272  2015q1  16269.0
273  2015q2  16374.2
274  2015q3  16454.9
275  2015q4  16490.7
276  2016q1  16525.0
277  2016q2  16583.1

[66 rows x 2 columns]

In [53]:
def convert_housing_data_to_quarters():
    '''Converts the housing data to quarters and returns it as mean 
    values in a dataframe. This dataframe should be a dataframe with
    columns for 2000q1 through 2016q3, and should have a multi-index
    in the shape of ["State","RegionName"].
    
    Note: Quarters are defined in the assignment description, they are
    not arbitrary three month periods.
    
    The resulting dataframe should have 67 columns, and 10,730 rows.
    '''
    import pandas as pd
    df = pd.read_csv('~/Downloads/City_Zhvi_AllHomes.csv')
    df = df.set_index(['RegionName','State'])
    #subset from 2000 to 2016:
    df1 = df.filter(regex = "^20", axis = 1)
    data_df = df1.groupby(pd.PeriodIndex(df1.columns, freq='Q'), axis=1).mean()
    return data_df.head()
convert_housing_data_to_quarters()

,,2000Q1,2000Q2,2000Q3,2000Q4,2001Q1,2001Q2,2001Q3,2001Q4,2002Q1,2002Q2,...,2014Q2,2014Q3,2014Q4,2015Q1,2015Q2,2015Q3,2015Q4,2016Q1,2016Q2,2016Q3
RegionName,State,,,,,,,,,,,,,,,,,,,,,
New York,NY,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,515466.666667,522800.000000,528066.666667,532266.666667,540800.000000,557200.000000,572833.333333,582866.666667,591633.333333,587200.0
Los Angeles,CA,207066.666667,214466.666667,220966.666667,226166.666667,233000.000000,239100.000000,245066.666667,253033.333333,261966.666667,272700.000000,...,498033.333333,509066.666667,518866.666667,528800.000000,538166.666667,547266.666667,557733.333333,566033.333333,577466.666667,584050.0
Chicago,IL,138400.000000,143633.333333,147866.666667,152133.333333,156933.333333,161800.000000,166400.000000,170433.333333,175500.000000,177566.666667,...,192633.333333,195766.666667,201266.666667,201066.666667,206033.333333,208300.000000,207900.000000,206066.666667,208200.000000,212000.0
Philadelphia,PA,53000.000000,53633.333333,54133.333333,54700.000000,55333.333333,55533.333333,56266.666667,57533.333333,59133.333333,60733.333333,...,113733.333333,115300.000000,115666.666667,116200.000000,117966.666667,121233.333333,122200.000000,123433.333333,126933.333333,128700.0
Phoenix,AZ,111833.333333,114366.666667,116000.000000,117400.000000,119600.000000,121566.666667,122700.000000,124300.000000,126533.333333,128366.666667,...,164266.666667,165366.666667,168500.000000,171533.333333,174166.666667,179066.666667,183833.333333,187900.000000,191433.333333,195200.0